[GraphicalObject]
Name=hyplock
Path=
Caption="ウェルプレート ハンドラ ロック"
WndStyle=BORDER|CAPTION
PosStyle=FLOATABLE
X=200
Y=30
Width=300
Height=110
FrameThickness=1
Activate=0
zorder=1
EraseBk=1
Set0=


[ToolDescriptor]
1=locktxt,static,hpgwct02.dll
2=unlock_bt,pushbutton,hpgbut02.dll


[fontalias]
1=normal|ＭＳ Ｐゴシック,9,normal
2=bold|ＭＳ Ｐゴシック,9,bold
3=boldplus|ＭＳ Ｐゴシック,10,Bold

[coloralias]
1=white|255,255,255
2=black|0,0,0
3=yellow|255,255,0
4=gray|192,192,192
5=red|255,0,0
6=green|0,255,0
7=blue|0,0,255

[static locktxt]
x=10
y=8
width=280
height=30
shiftx=0
shifty=2
dimage=4
justify=center

text1="ウェルプレート ハンドラはロックされています!"
Help=""
Font=boldplus
TEXTColor=black
BKColor=gray
Multiline=0

[PushButton unlock_bt]
x=100
y=50
height=20
width=100
enable=1
command =Hyper_Lock
ImageList=アンロック|アンロック|アンロック
font=ＭＳ Ｐゴシック,10,Bold
color=gray

TextColor=255,0,0
BKColor=gray



